tap "buo/cask-upgrade"
tap "da-luce/astroterm"
tap "daipeihust/tap"
tap "davep/homebrew"
tap "felixkratz/formulae"
tap "gromgit/brewtils"
tap "iina/mpv-iina"
tap "joncrangle/tap"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "tidwall/jj"
tap "tw93/tap"
brew "act"
brew "age"
brew "aichat"
brew "brotli"
brew "atuin"
brew "automake"
brew "bat"
brew "biome"
brew "btop"
brew "carapace"
brew "fftw"
brew "iniparser"
brew "portaudio"
brew "cava"
brew "chsrc"
brew "cmatrix"
brew "container", link: false
brew "coreutils"
brew "curlie"
brew "direnv"
brew "docker"
brew "docker-credential-helper"
brew "doggo"
brew "dust"
brew "duti"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fnm"
brew "python@3.14"
brew "fonttools"
brew "fzf"
brew "gdu"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git-crypt"
brew "git-delta"
brew "go"
brew "gowall"
brew "libtool"
brew "gtop"
brew "haskell-stack"
brew "pkgconf"
brew "helix"
brew "hyperfine"
brew "ifstat"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lla"
brew "lua"
brew "mas"
brew "mcat"
brew "media-control"
brew "media-info"
brew "mihomo"
brew "minify"
brew "mongosh"
brew "mpc"
brew "mpd"
brew "mpv"
brew "mysql", restart_service: :changed
brew "neovim"
brew "nowplaying-cli"
brew "nushell"
brew "oh-my-posh"
brew "onefetch"
brew "openjdk"
brew "pandoc"
brew "pipx"
brew "pngpaste"
brew "pnpm"
brew "podman"
brew "podman-compose"
brew "potrace"
brew "procs"
brew "python-argcomplete"
brew "ripgrep"
brew "rmpc"
brew "rust"
brew "scooter"
brew "scrcpy"
brew "sd"
brew "serie"
brew "sevenzip"
brew "somo"
brew "starship"
brew "stylua"
brew "switchaudio-osx"
brew "tealdeer"
brew "television"
brew "thefuck"
brew "tig"
brew "timg"
brew "tmux"
brew "tokei"
brew "topiary"
brew "tre"
brew "tree"
brew "uv"
brew "vips"
brew "vite"
brew "vivid"
brew "wget"
brew "woff2"
brew "xdg-ninja", args: ["HEAD"]
brew "yarn"
brew "yazi"
brew "zellij"
brew "zimfw"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "daipeihust/tap/im-select"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "gromgit/brewtils/taproom"
brew "joncrangle/tap/sketchybar-system-stats"
brew "jstkdng/programs/ueberzugpp"
brew "oven-sh/bun/bun"
brew "tidwall/jj/jj"
brew "tw93/tap/mole"
cask "alt-tab"
cask "android-platform-tools"
cask "antigravity"
cask "apifox"
cask "arc"
cask "chatgpt"
cask "claude-code"
cask "container"
cask "flashspace"
cask "folo"
cask "font-comic-shanns-mono-nerd-font"
cask "font-google-sans-code"
cask "font-hack-nerd-font"
cask "font-liga-comic-mono"
cask "font-maple-mono-nf-cn"
cask "font-monaspace"
cask "font-monocraft-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "google-chrome"
cask "jordanbaird-ice"
cask "kando"
cask "kitty"
cask "loop"
cask "lx-music"
cask "macfuse"
cask "microsoft-edge@dev"
cask "mos"
cask "neohtop"
cask "obsidian"
cask "piclist"
cask "pixpin"
cask "qq"
cask "rar"
cask "sf-symbols"
cask "squirrel-app"
cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "vivaldi"
cask "wechat"
cask "yaak"
cask "zed"
cask "zen"
mas "Command X", id: 6448461551
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Save to Raindrop.io", id: 1549370672
mas "TencentMeeting", id: 1484048379
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
vscode "alexdauenhauer.catppuccin-noctis-icons"
vscode "astral-sh.ty"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "brandonkirbyson.vscode-animations"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "cweijan.vscode-typora"
vscode "dautroc.yazi-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "edwinhuish.better-comments-next"
vscode "emranweb.daisyui-snippet"
vscode "enkia.tokyo-night"
vscode "evan-buss.font-switcher"
vscode "fabiospampinato.vscode-git-history"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "fr43nk.seito-openfile"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gxl.git-graph-3"
vscode "hediet.vscode-drawio"
vscode "huizhou.githd"
vscode "huytd.nord-light"
vscode "ionutvmi.path-autocomplete"
vscode "kuingsmile.vs-piclist"
vscode "leetcode.vscode-leetcode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "myriad-dreamin.tinymist"
vscode "naumovs.color-highlight"
vscode "nefrob.vscode-just-syntax"
vscode "oxc.oxc-vscode"
vscode "peaceroad.p7d-markdown-it-footnote-here"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "tompollak.lazygit-vscode"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wenfangdu.jump"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
