{
    "buckets": [
        {
            "Name": "main",
            "Source": "https://github.com/ScoopInstaller/Main",
            "Updated": "2025-01-31T20:32:04+08:00",
            "Manifests": 1356
        },
        {
            "Name": "extras",
            "Source": "https://github.com/ScoopInstaller/Extras",
            "Updated": "2025-01-31T20:33:44+08:00",
            "Manifests": 2122
        },
        {
            "Name": "versions",
            "Source": "https://github.com/ScoopInstaller/Versions",
            "Updated": "2025-01-31T20:54:05+08:00",
            "Manifests": 476
        },
        {
            "Name": "nerd-fonts",
            "Source": "https://github.com/matthewjberger/scoop-nerd-fonts",
            "Updated": "2025-01-24T17:22:14+08:00",
            "Manifests": 345
        },
        {
            "Name": "nonportable",
            "Source": "https://github.com/ScoopInstaller/Nonportable",
            "Updated": "2025-01-31T12:35:38+08:00",
            "Manifests": 127
        },
        {
            "Name": "java",
            "Source": "https://github.com/ScoopInstaller/Java",
            "Updated": "2025-01-31T09:18:20+08:00",
            "Manifests": 294
        },
        {
            "Name": "apps",
            "Source": "https://github.com/kkzzhizhou/scoop-apps",
            "Updated": "2025-01-31T12:35:11+08:00",
            "Manifests": 14366
        }
    ],
    "apps": [
        {
            "Info": "",
            "Name": "7zip",
            "Updated": "2024-12-01T19:28:11.0228086+08:00",
            "Version": "24.09",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "7zip19.00-helper",
            "Updated": "2024-10-10T11:08:02.9735539+08:00",
            "Version": "19.00",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "adb",
            "Updated": "2024-10-22T08:41:03.3037904+08:00",
            "Version": "35.0.2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "apifox",
            "Updated": "2025-01-05T14:53:51.9129066+08:00",
            "Version": "2.5.19",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "aria2",
            "Updated": "2024-06-05T18:07:14.5191784+08:00",
            "Version": "1.37.0-1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "autohotkey",
            "Updated": "2025-01-26T19:24:54.0616474+08:00",
            "Version": "2.0.19",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "bat",
            "Updated": "2025-01-08T21:02:50.0150233+08:00",
            "Version": "0.25.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "bottom",
            "Updated": "2025-01-25T12:10:24.7178943+08:00",
            "Version": "0.10.2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "btop",
            "Updated": "2024-06-05T18:11:20.6865275+08:00",
            "Version": "1.0.4",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "bun",
            "Updated": "2025-01-29T11:02:02.5940141+08:00",
            "Version": "1.2.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "busybox",
            "Updated": "2024-09-21T21:21:12.8216125+08:00",
            "Version": "5467-g9376eebd8",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "cheat",
            "Updated": "2024-06-06T16:36:14.722644+08:00",
            "Version": "4.4.2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "chsrc",
            "Updated": "2024-10-10T08:48:28.2143104+08:00",
            "Version": "0.1.9",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "curlie",
            "Updated": "2024-06-05T18:07:30.2229743+08:00",
            "Version": "1.7.2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "dark",
            "Updated": "2024-06-05T18:07:32.3441012+08:00",
            "Version": "3.14",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "delta",
            "Updated": "2025-01-25T12:16:24.9355984+08:00",
            "Version": "0.18.2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "doggo",
            "Updated": "2024-10-03T14:42:15.8881576+08:00",
            "Version": "1.0.5",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "dust",
            "Updated": "2024-07-18T14:26:41.9952076+08:00",
            "Version": "1.1.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "eza",
            "Updated": "2025-01-30T19:51:25.0023827+08:00",
            "Version": "0.20.19",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "fastfetch",
            "Updated": "2025-01-26T19:22:49.5034985+08:00",
            "Version": "2.35.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "fd",
            "Updated": "2024-08-30T13:35:26.0223405+08:00",
            "Version": "10.2.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "feishu",
            "Updated": "2025-01-26T19:24:13.983413+08:00",
            "Version": "7.35.8",
            "Source": "apps"
        },
        {
            "Info": "",
            "Name": "ffmpeg",
            "Updated": "2024-10-01T14:06:13.627882+08:00",
            "Version": "7.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "flow-launcher",
            "Updated": "2025-01-29T11:03:23.9762401+08:00",
            "Version": "1.19.5",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "fzf",
            "Updated": "2025-01-23T23:32:29.0266095+08:00",
            "Version": "0.58.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "gcc",
            "Updated": "2024-09-25T16:22:51.8635484+08:00",
            "Version": "13.2.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "geekuninstaller",
            "Updated": "2024-06-06T21:01:31.7027085+08:00",
            "Version": "1.5.2.165",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "gh",
            "Updated": "2025-01-31T21:24:47.2985071+08:00",
            "Version": "2.66.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "git",
            "Updated": "2025-01-16T20:33:43.4576611+08:00",
            "Version": "2.47.1.2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "gitui",
            "Updated": "2025-01-16T20:33:45.9530257+08:00",
            "Version": "0.27.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "go",
            "Updated": "2025-01-19T19:19:41.7765026+08:00",
            "Version": "1.23.5",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "gzip",
            "Updated": "2024-10-04T00:12:17.3576829+08:00",
            "Version": "1.3.12",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "hyperfine",
            "Updated": "2024-11-12T14:35:49.9787916+08:00",
            "Version": "1.19.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "innounp",
            "Updated": "2025-01-24T00:25:01.2941477+08:00",
            "Version": "2.64",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "jetbrainsmono-nf",
            "Updated": "2024-11-20T19:20:37.1111413+08:00",
            "Version": "3.3.0",
            "Source": "nerd-fonts"
        },
        {
            "Info": "",
            "Name": "jq",
            "Updated": "2024-06-29T19:55:03.8155598+08:00",
            "Version": "1.7.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "lazydocker",
            "Updated": "2024-11-24T22:26:21.4038739+08:00",
            "Version": "0.24.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "lazygit",
            "Updated": "2025-01-23T23:18:55.609006+08:00",
            "Version": "0.45.2",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "less",
            "Updated": "2025-01-30T19:55:16.4062307+08:00",
            "Version": "668",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "libwebp",
            "Updated": "2024-12-21T23:02:05.3294148+08:00",
            "Version": "1.5.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "lua",
            "Updated": "2024-07-27T14:36:14.7302721+08:00",
            "Version": "5.4.7-2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "maven",
            "Updated": "2024-10-22T20:49:36.1909196+08:00",
            "Version": "3.9.9",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "monaspace",
            "Updated": "2024-11-07T08:45:06.9208687+08:00",
            "Version": "1.101",
            "Source": "nerd-fonts"
        },
        {
            "Info": "",
            "Name": "mysql",
            "Updated": "2025-01-23T23:32:25.6874973+08:00",
            "Version": "9.2.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "neovim",
            "Updated": "2025-01-30T15:31:05.5216799+08:00",
            "Version": "0.10.4",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "nmap",
            "Updated": "2024-10-25T20:42:09.3632428+08:00",
            "Version": "7.95",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "nodejs-lts",
            "Updated": "2025-01-23T23:30:36.9813737+08:00",
            "Version": "22.13.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "nu",
            "Updated": "2025-01-03T19:28:03.8132373+08:00",
            "Version": "0.101.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "obsidian",
            "Updated": "2025-01-31T21:25:17.0142127+08:00",
            "Version": "1.8.3",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "oh-my-posh",
            "Updated": "2024-11-24T22:26:29.8589383+08:00",
            "Version": "24.8.0",
            "Source": "https://github.com/JanDeDobbeleer/oh-my-posh/releases/latest/download/oh-my-posh.json"
        },
        {
            "Info": "",
            "Name": "openjdk23",
            "Updated": "2025-01-24T00:27:14.1156416+08:00",
            "Version": "23.0.2-7",
            "Source": "java"
        },
        {
            "Info": "",
            "Name": "picgo",
            "Updated": "2024-11-19T19:08:12.0327701+08:00",
            "Version": "2.3.1",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "pipx",
            "Updated": "2024-08-30T13:37:18.2336336+08:00",
            "Version": "1.7.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "powershell-preview",
            "Updated": "2025-01-24T00:26:23.1784179+08:00",
            "Version": "7.6.0-preview.2",
            "Source": "apps"
        },
        {
            "Info": "",
            "Name": "procs",
            "Updated": "2025-01-19T19:20:04.5005004+08:00",
            "Version": "0.14.9",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "python",
            "Updated": "2024-12-04T14:04:09.0917532+08:00",
            "Version": "3.13.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "rclone",
            "Updated": "2025-01-17T00:27:16.7119076+08:00",
            "Version": "1.69.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "ripgrep",
            "Updated": "2024-09-10T15:26:28.0301319+08:00",
            "Version": "14.1.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "scoop-search",
            "Updated": "2025-01-17T00:27:11.3857914+08:00",
            "Version": "2.0.0",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "starship",
            "Updated": "2025-01-16T20:33:22.4367117+08:00",
            "Version": "1.22.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "steam",
            "Updated": "2024-09-21T21:43:30.3390227+08:00",
            "Version": "nightly-20240921",
            "Source": "apps"
        },
        {
            "Info": "",
            "Name": "tokei",
            "Updated": "2024-09-30T14:19:13.1036832+08:00",
            "Version": "12.1.2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "typora",
            "Updated": "2024-11-20T16:54:18.7873839+08:00",
            "Version": "1.9.5",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "unar",
            "Updated": "2024-06-29T19:55:11.2486154+08:00",
            "Version": "1.8.1",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "uv",
            "Updated": "2025-01-31T21:24:42.4477776+08:00",
            "Version": "0.5.26",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "vivetool",
            "Updated": "2024-11-15T15:10:09.7123129+08:00",
            "Version": "0.3.3",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "vscode",
            "Updated": "2025-01-25T03:14:15.571073+08:00",
            "Version": "1.96.4",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "wechat",
            "Updated": "2024-12-15T19:16:23.977888+08:00",
            "Version": "3.9.12.17",
            "Source": "extras"
        },
        {
            "Info": "",
            "Name": "windows-terminal-preview",
            "Updated": "2024-11-20T19:17:41.778378+08:00",
            "Version": "1.22.3232.0",
            "Source": "versions"
        },
        {
            "Info": "",
            "Name": "yarn",
            "Updated": "2024-07-24T00:42:18.5671476+08:00",
            "Version": "1.22.22",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "yazi",
            "Updated": "2024-12-21T23:01:48.7500528+08:00",
            "Version": "0.4.2",
            "Source": "main"
        },
        {
            "Info": "",
            "Name": "zoxide",
            "Updated": "2024-09-20T21:14:29.0945323+08:00",
            "Version": "0.9.6",
            "Source": "main"
        }
    ]
}
