aaron-bond.better-comments
alefragnani.project-manager
alexdauenhauer.catppuccin-noctis-icons
be5invis.vscode-custom-css
brandonkirbyson.vscode-animations
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
cweijan.vscode-typora
davidanson.vscode-markdownlint
docker.docker
enkia.tokyo-night
evan-buss.font-switcher
filwaline.vscode-postfix-python
foam.foam-vscode
formulahendry.code-runner
foxundermoon.shell-format
gera2ld.markmap-vscode
github.copilot
github.copilot-chat
goessner.mdmath
golang.go
gruntfuggly.todo-tree
gxl.git-graph-3
hediet.vscode-drawio
jasonlhy.hungry-delete
krysenlo.vscode-wordcount-cjk
leetcode.vscode-leetcode
mads-hartmann.bash-ide-vscode
meow-d.markless-meowd
miguelsolorio.fluent-icons
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.vscode-speech
ms-vscode.vscode-websearchforcopilot
mutantdino.resourcemonitor
naumovs.color-highlight
pkief.material-icon-theme
pomdtr.excalidraw-editor
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
rooveterinaryinc.roo-cline
roscop.activefileinstatusbar
ryanraposo.codeui
shalldie.background
sharzyl.cjk-word-handler
shd101wyy.markdown-preview-enhanced
subframe7536.codeimg
sumneko.lua
sysoev.language-stylus
tamasfe.even-better-toml
thenuprojectcontributors.vscode-nushell-lang
thqby.vscode-autohotkey2-lsp
tkhs-0114.sidebar-animation
usernamehw.errorlens
usernamehw.find-jump
visualstudioexptteam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-pack
vspacecode.whichkey
w88975.code-translate
wakatime.vscode-wakatime
yzhang.dictionary-completion
yzhang.markdown-all-in-one
